Revit 2027 API
ParameterTypeId.PointAdaptiveConstrained Property
 "Constrained"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PointAdaptiveConstrained { get; }
Public Shared ReadOnly Property PointAdaptiveConstrained As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PointAdaptiveConstrained {
	ForgeTypeId^ get ();
}
static member PointAdaptiveConstrained : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace